{
  "about": {
    "description": "Back in 2022, I dove deep into the world of web development, starting with projects using the MERN stack and Angular. Since then, I’ve had the opportunity to work with leading organizations in technology and innovation, including Lattice Innovations and Nagarro, where I’ve created robust front-end and back-end solutions and improved cloud infrastructures. Currently, my focus is on developing seamless single-page applications at Lattice Innovations using Angular, while ensuring optimized performance and scalability. I enjoy working at the intersection of back-end efficiency and front-end design, making sure applications are both powerful and user-friendly. In my free time, I explore AWS services, keeping up with the latest in cloud technology. When I’m not coding, I’m either sharpening my problem-solving skills, learning about new frameworks, or exploring nature in Dehradun."
  },
  "experience": [
    {
      "title": "Angular Developer",
      "company": "Lattice Innovations",
      "location": "Delhi, India",
      "dates": "Aug 2023 - Present",
      "responsibilities": "Developed single-page web applications using Angular, optimized server configuration with NGINX for better scalability, and integrated Google Analytics for traffic tracking.",
      "skills": ["Angular", "NGINX", "Google Analytics", "Anuglar Material", "Github"]
    },
    {
      "title": "MERN Stack Developer",
      "company": "GLC Yuvamanthan",
      "location": "Ghaziabad, India",
      "dates": "Feb 2023 – Jul 2023",
      "responsibilities": "Led MERN stack web application development, optimized back-end code with Express.js, and designed user-friendly interfaces using Material UI.",
      "skills": ["MERN Stack", "React.js", "Express.js", "Node.js", "MongoDB", "Material UI"]
    },
    {
      "title": "AWS Cloud Associate",
      "company": "Nagarro",
      "location": "Dehradun, India",
      "dates": "Sep 2022 – Feb 2023",
      "responsibilities": "Managed and implemented AWS services like EC2, S3, Lambda, and assisted in troubleshooting cloud infrastructure issues.",
      "skills": ["AWS", "EC2", "S3", "RDS", "Lambda", "CloudFormation"]
    }
  ],
  "education": [
    {
      "degree": "Master of Computer Applications",
      "institution": "Graphic Era University",
      "location": "Dehradun",
      "dates": "Aug 2022 - Jun 2024"
    },
    {
      "degree": "Bachelor of Computer Applications",
      "institution": "Graphic Era University",
      "location": "Dehradun",
      "dates": "Jul 2019 - Apr 2022"
    }
  ],
  "skills": {
    "front_end": ["React.js", "Next.js", "Angular", "Material UI"],
    "back_end": ["Express.js", "Socket.io", "Sequelize"],
    "devops": ["AWS", "NGINX"],
    "languages": ["JavaScript", "TypeScript"]
  },
  "projects": [
    {
      "name": "E-commerce App",
      "description": "A full-stack e-commerce web application using MERN stack with real-time chat support using Socket.io."
    },
    {
      "name": "Portfolio Website",
      "description": "Developed and deployed a personal portfolio using Next.js and Material UI, showcasing professional work and projects."
    }
  ]
}
